tutorial_cases/bdofoam_cases/nonreact/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "${FOAM_CASE}/constant/globalTransport"

Db #calc "$DiaBcol";
mDb #calc "-$Db";

defaultFieldValues
(
    volScalarFieldValue alpha.gas 1
    volScalarFieldValue alpha.liquid 0
);

regions
(
    boxToCell
    {
        box ($mDb 0.0 $mDb) ($Db $LiqHt $Db);
        fieldValues
        (
            volScalarFieldValue alpha.gas 0.0
            volScalarFieldValue alpha.liquid 1.0
            //volScalarFieldValue O2.liquid 3.2e-6 // 8e-6 = 0.25 mol/m^3
        );
    }
);


// ************************************************************************* //
